{
  "added_tokens_decoder": {
    "0": {
      "content": "[UNK]",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "1": {
      "content": "<|begin_of_text|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "2": {
      "content": "<|end_of_text|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "3": {
      "content": "[PAD]",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65491": {
      "content": "<|im_start|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65492": {
      "content": "<|im_end>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65493": {
      "content": "<think>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65494": {
      "content": "</think>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65495": {
      "content": "source_1",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65496": {
      "content": "source_2",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65497": {
      "content": "source_3",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65498": {
      "content": "source_4",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65499": {
      "content": "source_5",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65500": {
      "content": "source_6",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65501": {
      "content": "source_7",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65502": {
      "content": "source_8",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65503": {
      "content": "source_9",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65504": {
      "content": "source_10",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65505": {
      "content": "<ref",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65506": {
      "content": "</ref>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65507": {
      "content": "→",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65508": {
      "content": "↺",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65509": {
      "content": "※",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65510": {
      "content": "?maybe?",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65511": {
      "content": "●",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65512": {
      "content": "◐",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65513": {
      "content": "○",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65514": {
      "content": "⚠",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65515": {
      "content": "☐",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65516": {
      "content": "☑",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65517": {
      "content": "✓",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65518": {
      "content": "⟨H≈0.1⟩",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65519": {
      "content": "⟨H≈0.2⟩",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65520": {
      "content": "⟨H≈0.3⟩",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65521": {
      "content": "⟨H≈0.4⟩",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65522": {
      "content": "⟨H≈0.5⟩",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65523": {
      "content": "⟨H≈0.6⟩",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65524": {
      "content": "⟨H≈0.7⟩",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65525": {
      "content": "⟨H≈0.8⟩",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65526": {
      "content": "⟨H≈0.9⟩",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65527": {
      "content": "⟨H≈1.0⟩",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65528": {
      "content": "⟨H≈1.1⟩",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65529": {
      "content": "⟨H≈1.2⟩",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65530": {
      "content": "⟨H≈1.3⟩",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65531": {
      "content": "⟨H≈1.4⟩",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65532": {
      "content": "⟨H≈1.5⟩",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65533": {
      "content": "⟨H≈1.6⟩",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65534": {
      "content": "⟨H≈1.7⟩",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "65535": {
      "content": "⟨H≈1.8⟩",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    }
  },
  "additional_special_tokens": [
    "<|im_start|>",
    "<|im_end>",
    "<think>",
    "</think>",
    "source_1",
    "source_2",
    "source_3",
    "source_4",
    "source_5",
    "source_6",
    "source_7",
    "source_8",
    "source_9",
    "source_10",
    "<ref",
    "</ref>",
    "→",
    "↺",
    "※",
    "?maybe?",
    "●",
    "◐",
    "○",
    "⚠",
    "☐",
    "☑",
    "✓",
    "⟨H≈0.1⟩",
    "⟨H≈0.2⟩",
    "⟨H≈0.3⟩",
    "⟨H≈0.4⟩",
    "⟨H≈0.5⟩",
    "⟨H≈0.6⟩",
    "⟨H≈0.7⟩",
    "⟨H≈0.8⟩",
    "⟨H≈0.9⟩",
    "⟨H≈1.0⟩",
    "⟨H≈1.1⟩",
    "⟨H≈1.2⟩",
    "⟨H≈1.3⟩",
    "⟨H≈1.4⟩",
    "⟨H≈1.5⟩",
    "⟨H≈1.6⟩",
    "⟨H≈1.7⟩",
    "⟨H≈1.8⟩"
  ],
  "clean_up_tokenization_spaces": true,
  "extra_special_tokens": {},
  "model_max_length": 1000000000000000019884624838656,
  "tokenizer_class": "PreTrainedTokenizer"
}
